app/controllers/experiences_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "experiences".* FROM "experiences" WHERE "experiences"."user_id" = $1  [["user_id", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @experiences = Experience.where(user_id: @user.id)

SELECT "experiences".* FROM "experiences"
---
  def all
    @experiences = Experience.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:user_id])
    @experience = Experience.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "experiences" ("exp_type", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["exp_type", ""], ["description", ""], ["created_at", "2019-04-10 00:10:26.931755"], ["updated_at", "2019-04-10 00:10:26.931755"], ["user_id", 2]]
---
  def create
    @user = User.find(params[:user_id])
    @experience = Experience.new(experience_params)

    if @experience.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
UPDATE "experiences" SET "final_rating" = $1, "updated_at" = $2 WHERE "experiences"."id" = $3  [["final_rating", 10], ["updated_at", "2019-04-09 19:13:37.870831"], ["id", 34]]
---
  def update
    @user = User.find(params[:user_id])
    @experience = Experience.find(params[:id])
    if @experience.update(update_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "experiences" WHERE "experiences"."id" = $1  [["id", 31]]
---
  def destroy
    @user = User.find(params[:user_id])
    @experience = Experience.find(params[:id])
    @experience.destroy

SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
  def set_experience
    @experiences = Experience.find(params[:id])